app/controllers/folders_controller.rb

  def index
    render json: Folder.all.to_json
---
SELECT "folders".* FROM "folders"

  def create
    respond_with Folder.create(folder_params)
---
INSERT INTO "folders" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-16 07:35:43.241085"], ["description", "Smartie Project"], ["name", "Smartie"], ["updated_at", "2015-02-16 07:35:43.241085"]]

    def set_folder
      @folder = Folder.find(params[:id])
---
SELECT  "folders".* FROM "folders"  WHERE "folders"."id" = ? LIMIT 1  [["id", 1]]