app/controllers/lists_controller.rb

    def set_list
      @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 2]]