app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "finished_at", "list_id", "name", "priority", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)