app/controllers/to_dos_controller.rb

  def index
    @to_dos = ToDo.all
---
SELECT "to_dos".* FROM "to_dos"

  def create
    @to_do = ToDo.new(to_do_params)

    respond_to do |format|
      if @to_do.save
---
INSERT INTO "to_dos" ("folder_id", "name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["folder_id", 2], ["name", "Puships"], ["description", "50 of those"], ["created_at", "2015-02-16 08:31:02.721070"], ["updated_at", "2015-02-16 08:31:02.721070"]]

  def update
    respond_to do |format|
      if @to_do.update(to_do_params)
---
UPDATE "to_dos" SET "folder_id" = ?, "updated_at" = ? WHERE "to_dos"."id" = ?  [["folder_id", 2], ["updated_at", "2015-02-16 08:30:48.155056"], ["id", 1]]

    def set_to_do
      @to_do = ToDo.find(params[:id])
---
SELECT  "to_dos".* FROM "to_dos"  WHERE "to_dos"."id" = ? LIMIT 1  [["id", 1]]